html/blog/starccm-meshing.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2025-11-22 Sat 15:51 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Structured meshing in STAR-CCM+</title>
<meta name="author" content="jakub" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">Structured meshing in STAR-CCM+</h1>
<p>
[<a href="../index.html">return</a>]
</p>
<div id="outline-container-orgae2c552" class="outline-2">
<h2 id="orgae2c552">The problem</h2>
<div class="outline-text-2" id="text-orgae2c552">
<p>
The RPI model implementation in STAR-CCM+ doesn't allow for the liquid temperature at a fixed y+ to be used as the liquid temperature. The consequence is that it is impossible to follow the usual mesh independence procedure, as the results are <a href="https://doi.org/10.1016/j.applthermaleng.2024.122678">the results are dependent on the thickness of the near-wall cell</a>. Mesh independence can only be shown for the bulk region, and therefore a structured meshing approach which allows the near-wall cell to remain the same size is needed. Commercial software is not generally well suited to structured meshing applications, and STAR-CCM+ is no exception. Using prism layers proves to be highly unreliable in this case, with their thicknesses varying sufficiently to disturb the calculation even with the utmost care on the part of the engineer. The real solution proves to be far more convoluted.
</p>
</div>
</div>
<div id="outline-container-org6392f5c" class="outline-2">
<h2 id="org6392f5c">The solution</h2>
<div class="outline-text-2" id="text-org6392f5c">
<p>
The following presents the meshing approach for a circular pipe using a 2D axisymmetric mesh. It assumes basic familiarity with STAR-CCM+ usage.
</p>

<ol class="org-ol">
<li>Create parts for the pipe and wall cell layer using an extrude.</li>
<li>Perform an imprint operation, selecting the CAD imprint option.</li>
<li>Perform a badge for 2D meshing operation.</li>
<li>Create a directed mesh operation, setting the source and target.</li>
<li>Create a quadrilateral automated mesh.</li>
<li>Set the base size of the mesh equal to the channel radius.</li>
<li>Set the target and minimum sizes at 100% relative to the base size.</li>
<li>Select user specified growth rate.</li>
<li>Create a custom volumetric control. Enable customise size on surface remesher, and set it to the wall cell layer thickness. Don't forget to select the input part.</li>
<li>Right click &gt; edit on the quadrilateral mesh, disable proximity and curvature refinement for good measure.</li>
<li>Control the radial cell count using the surface growth rate.</li>
</ol>

<p>
A basic Emacs lisp script example is provided below to obtain the required growth rate for a specified number of cells.
</p>

<div class="org-src-container">
<pre class="src src-elisp">  <span style="color: #ffffff;">(</span><span style="color: #79a8ff; font-weight: bold;">setq</span> radius 4e-3<span style="color: #ffffff;">)</span>
  <span style="color: #ffffff;">(</span><span style="color: #79a8ff; font-weight: bold;">setq</span> first-cell 0.00007649339528760109<span style="color: #ffffff;">)</span>
  <span style="color: #ffffff;">(</span><span style="color: #79a8ff; font-weight: bold;">setq</span> tol 1e-10<span style="color: #ffffff;">)</span>
  <span style="color: #ffffff;">(</span><span style="color: #79a8ff; font-weight: bold;">setq</span> cells 15<span style="color: #ffffff;">)</span>

  <span style="color: #ffffff;">(</span><span style="color: #79a8ff; font-weight: bold;">defun</span> <span style="color: #f78fe7;">fr</span> <span style="color: #ff66ff;">(</span>r<span style="color: #ff66ff;">)</span>
    <span style="color: #ff66ff;">(</span>-
     <span style="color: #00eff0;">(</span>* radius <span style="color: #ff6b55;">(</span>- 1 r<span style="color: #ff6b55;">)</span><span style="color: #00eff0;">)</span>
     <span style="color: #00eff0;">(</span>* first-cell
        <span style="color: #ff6b55;">(</span>- 1 <span style="color: #efef00;">(</span>expt r cells<span style="color: #efef00;">)</span><span style="color: #ff6b55;">)</span><span style="color: #00eff0;">)</span><span style="color: #ff66ff;">)</span><span style="color: #ffffff;">)</span>

  <span style="color: #ffffff;">(</span><span style="color: #79a8ff; font-weight: bold;">defun</span> <span style="color: #f78fe7;">frprime</span> <span style="color: #ff66ff;">(</span>r<span style="color: #ff66ff;">)</span>
    <span style="color: #ff66ff;">(</span>-
     <span style="color: #00eff0;">(</span>* first-cell cells <span style="color: #ff6b55;">(</span>expt r <span style="color: #efef00;">(</span>- cells 1<span style="color: #efef00;">)</span><span style="color: #ff6b55;">)</span><span style="color: #00eff0;">)</span>
     radius
     <span style="color: #ff66ff;">)</span><span style="color: #ffffff;">)</span>

  <span style="color: #ffffff;">(</span><span style="color: #79a8ff; font-weight: bold;">defun</span> <span style="color: #f78fe7;">newton-next</span> <span style="color: #ff66ff;">(</span>x fun deriv<span style="color: #ff66ff;">)</span>
    <span style="color: #ff66ff;">(</span>-
     x
     <span style="color: #00eff0;">(</span>/
      <span style="color: #ff6b55;">(</span>funcall fun x<span style="color: #ff6b55;">)</span>
      <span style="color: #ff6b55;">(</span>funcall deriv x<span style="color: #ff6b55;">)</span><span style="color: #00eff0;">)</span><span style="color: #ff66ff;">)</span><span style="color: #ffffff;">)</span>

  <span style="color: #ffffff;">(</span><span style="color: #79a8ff; font-weight: bold;">defun</span> <span style="color: #f78fe7;">newton-run</span> <span style="color: #ff66ff;">(</span>x fun deriv tolerance<span style="color: #ff66ff;">)</span>
      <span style="color: #ff66ff;">(</span><span style="color: #79a8ff; font-weight: bold;">while</span> <span style="color: #00eff0;">(</span>&gt; <span style="color: #ff6b55;">(</span>abs <span style="color: #efef00;">(</span>funcall fun x<span style="color: #efef00;">)</span><span style="color: #ff6b55;">)</span> tolerance<span style="color: #00eff0;">)</span>
        <span style="color: #00eff0;">(</span><span style="color: #79a8ff; font-weight: bold;">setq</span> x <span style="color: #ff6b55;">(</span>newton-next x fun deriv<span style="color: #ff6b55;">)</span><span style="color: #00eff0;">)</span><span style="color: #ff66ff;">)</span>
    x<span style="color: #ffffff;">)</span>

<span style="color: #ffffff;">(</span>newton-run 2 'fr 'frprime tol<span style="color: #ffffff;">)</span>

</pre>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: jakub</p>
<p class="date">Created: 2025-11-22 Sat 15:51</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
